export const defaultDailyTemplate = `(مشروع محطة السويس بقدرة 1,1 جيجا وات - طاقه الرياح- برأس غارب )

عقد عمل عماله غير منتظمة

الرقم المرجعي: YU-CONT-DAILY
التاريخ: {{اليوم}}
شركة {{اسم_الشركة}}
المقر الرئيسي: {{عنوان_الشركة}}

انه في يوم {{يوم}} الموافق {{تاريخ_البداية}} قد تم الاتفاق بين كل من:

-1 الطرف الاول : {{اسم_الشركة}} ويمثلها: {{ممثل_الشركة}} بصفته: {{صفة_ممثل_الشركة}} و عنوانه: {{عنوان_الشركة}} سجل تجاري رقم {{سجل_تجاري}} بطاقه ضريبيه رقم {{بطاقة_ضريبية}} بموقع: {{موقع_المشروع}}

-2 الطرف الثاني : السيد: {{الاسم_الكامل}} وعنوانه : {{العنوان}}

-3 ويحمل بطاقة رقم قومي برقم : {{الرقم_القومي}} صادر بتاريخ : {{صادر_بتاريخ}} بمهنة: {{الوظيفة}} مؤهل : {{المؤهل}}

أتفق الطرفان على ان يقوم الطرف الثاني بالأعمال المكلف بها طبقا لمهنته المدونة بالعقد لحين انتهاء هذه الاعمال بموقع العمل وفقا لاحتياجات الشركة وطبقا للشروط والاحكام الواردة في هذا العقد ويتعهد بالالتزامات المذكورة في هذا العقد.

- اتفق الطرفان وبموجب هذا العقد على ان يعمل الطرف الثاني لدى الطرف الأول بالشروط الاتية:

البند الاول : ( الوظيفة ومدة التعاقد )

يعمل الطرف الثاني تحت إدارة الطرف الأول بمنشاته بعالية في مهنة: {{الوظيفة}} وذلك اعتبارا من يوم {{يوم}} الموافق {{تاريخ_البداية}} و ينتهي العقد بانتهاء العمل المكلف به داخل المشروع دون الحاجه الي تنبيه او انذار ودون الحاجه الي اتخاذ اي اجراء قانوني او قضائي وال يجدد في جميع الاحوال الا بموافقه طرفي العقد.

البند الثاني:( الاجر-ساعات العمل )

أتفق الطرفان على ان يكون الاجر الذي يتقاضاه الطرف الثاني والمتفق عليه بمبلغ {{الأجر}} جنيهاً مصرياً فقط لا غير

و يتم صرف الراتب " يوميا " علي ان يتم صرف الراتب في يوم الاول من كل شهر حتى اليوم الخامس و في حالة حاجه العمل والعمل لوقت أضافي يقوم الطرف الاول باحتساب ساعه الاضافي (طبقا لقانون العمل رقم 14 لسنه 2025 وتعديلاته واللوائح المنفذه له ).

أتفق الطرفان على تأدية الطرف الثاني لأعمال المكلف بها لعدد 9 ساعات يتضمنها ساعة راحة.

البند الثالث : ( المهام الوظيفية )

-1 يلتزم الطرف الثاني بأداء عمله المشار الي عاليه (المهنه ) علي أكمل وجه مع المحافظه علي سرية العمل واطاعه التعليمات والالتزام بمواعيد العمل التي يتم تحديدها طبقا للوائح الداخليه

-2يلتزم الطرف الثاني باتباع تعليمات السلامه والصحه المهنيه والبيئه والمتطلبات الاجتماعيه واتباع القواعد السلوكيه واخلاقيات العمل الجيد المتبعه داخل المشروع واتباع اللوائح القانونيه المحليه الخاصه بتنظيم العمل

البند الرابع : ( مصوغات التعيين )

يتعهد الطرف الثاني باستيفاء كافة مصوغات التعيين المطلوبة من قبل الشركة في الموعد المتفق عليه وقبل البدء في العمل ويقر بصحه كل البيانات والعناوين وكذلك يتعهد بصحه مصوغات التعيين المقدمة من خاله للشركة

البند الخامس : (المزايا والاستقطاعات )

لا يجوز خصم أي ميزات (عينية – نقدية) من اجر العامل المتفق عليه بالعقد نتيجه توفير الملابس الوقائيه او غيرها مما لا يتضمنه الراتب ويتحملها بالكامل الطرف الأول مثل (الملابس الوقائية – توفير المواصلات الامنة – توفير وجبة غذائية – توفير مياه مناسبه للطقس – الاقامه المناسبة للمغتربين - المرافق العامه بموقع العمل .............الخ(. في حالات الاصابه يتحمل الطرف الأول التكاليف العلاجيه في حالة الإصابة وطبقا لقانون العمل والقواني المحليه و اللوائح والضوابط المنظمه له .

البند السادس : ( انهاء التعاقد )

وينتهي عمل الطرف الثاني بالشركة بأحد الأحوال الاتية:
• انتهاء العمل المكلف به داخل المشروع.
• انتهاء مده العقد
• ينتهي هذا التعاقد بالتسبب او مخالفه اي من الاسباب المبينة في المخالفات الخاصه بقانون العمل رقم 14 لسنه 2025 أو لوائح العمل الداخلية
• مخالفه تعليمات السلامه والصحه المهنيه والبيئه والمتطلبات الاجتماعيه الخاصه والمعلنه للمشروع وتهديد حياة الاخرين للخطر

والطرف الثاني لا يحق له الرجوع الي الشركة بأي حال من الأحوال بالمطالبة بأي مستحقات مالية او معنوية بعد انتهاء العمل المكلف به من قبل الشركة او بانتهاء المدة المتفق عليها أو بناءا على حاجة العمل أو تعليمات (صاحب العمل)، بعد حصوله على مستحقاته المالية والمعنوية.

البند السابع :القانون الواجب التطبيق :

حقوق والتزامات طرفي هذا العقد وعلاقة العمل التي بينهما تخضع لأحكام قانون العمل المصري رقم 14 لسنة 2025 وتعديلاته ومفسرا ومكملا للعقد من أحكام وشروط كما يسري عليه أحكام قانون التأمينات الاجتماعية رقم 148 لسنه 2019 وكافة القوانين والقرارات المعدلة له.

البند الثامن: (الاخطارات) :

يقر كلا من طرف العقد بان العنوان الثابت في البطاقة الشخصية وعنوان الشركة هما العنوان الرسمي في حالات الاخطار او الاعلان عن أي شيء .

نسخ العقد : يحرر هذا العقد من 4 نسخ لكل طرف نسخه ويتم الاحتفاظ بالنسخ الاخرى لتقديمها عند الحاجه الي تقديمها الي الجهات المعنية داخل المشروع او خارجه .

• في حاله رغبتك في تقديم شكوى يمكنك ( في حاله رغبتك ) بشكل مبدئي التواصل مع المشرف او المهندس المسئول شفويا للمساعده في حل المشكله وعند عدم حل الشكوي يتم التواصل مع فريق الشكاوي للطرف الاول (الشركه ) لتقديم شكوي رسميه وفي حاله عدم حل المشكله او الرغبه في التصعيد يتم اتباع اليه الشكاوي الخاصه بالموقع .

توقيع الطرف الأول (الشركة )     توقيع الطرف الثاني ( العامل )
الاسم : {{اسم_الشركة}}            الاسم : {{الاسم_الكامل}}
التوقيع: ...........................     التوقيع: ...........................`;

export const defaultPermanentTemplate = `الرقم المرجعي: YU-CONT-FIXED
التاريخ: {{اليوم}}

شركة {{اسم_الشركة}}
المقر الرئيسي: {{عنوان_الشركة}}

عقد عمل محدد المدة (固定期限（劳动合同

$$本合同于 【 】年【 】月【 】日 订立。$$ ||| انه في يوم {{اليوم}} الموافق {{تاريخ_البداية}} تم تحرير هذا العقد بين كل من:

甲方（雇主）： 远大建筑与商业服务公司 (Yuanda for Contracting and Commercial Services) ||| الطرف الاول : شركة يواندا للمقاولات و الخدمات التجاريه
商业登记号： 207375 ||| سجل تجاري رقم 207375
税务卡号： 752/703/218 ||| بطاقه ضريبيه رقم 752/703/218
地址： Villa 3 – District 12024 – Elemam ElBasery Street – First Settlement ||| ومقرها ：فيلا – 3 منطقة – 12024 شارع الإمام البصيري – التجمع الأول
法定代表人/分支机构经理或其授权代表 ||| ويمثلها في هذا العقد قانونا السيد -----------------------------
（以下简称“公司”或“甲方”） ||| مدير فرع او ما ينوب عنه (طرف أول). (ويشار إليها فيما بعد بالشركة أو صاحب العمل)

乙方（员工/工人）： ||| الطرف الثاني: السيد / السيدة [{{الاسم_الكامل}}]
[{{الاسم_الكامل}}] 先生/女士 ||| ويحمل بطاقة تحقيق الشخصيه رقم [{{الرقم_القومي}}]
身份证号：[{{الرقم_القومي}}] ||| والمقيم في [{{العنوان}}]
居住地：[{{العنوان}}] ||| حاصل على [{{المؤهل}}]
学历：[{{المؤهل}}] ||| (ويشار إليها فيما بعد بالعامل أو الموظف)
（以下简称“员工”或“乙方”） |||

双方在此声明其具备完全的签约民事行为能力，并达成如下协议： ||| أقر الطرفان بأهليتهما للتعاقد واتفقا على ما يلي:

تمهيد / 前言 ||| تمهيد / 前言

鉴于甲方需要乙方根据 2025 年第 14 号《埃及劳动法》第（31）条的规定提供服务，且本工作性质属于本合同第一条第一款所规定的特定岗位 and 具体任务；同时，鉴于乙方愿意为甲方工作，并确认自己完全具备履行本合同所述临时工作义务的资格。因此，甲方同意根据 2025 年第 14 号《埃及劳动法》中关于临时合同的相关规定录用乙方。 ||| حيث ان الطرف الأول في حاجة الى خدمات الطرف الثاني طبقا لأحكام المادة 31 من قانون العمل رقم 14 لسنة 2025 ، وطبيعة العمل الذي نص عليه منصبة على أداء أعمال معينه ومهام محددة كما نصت عليه المادة رقم (01) الفقرة رقم (1) من هذا العقد، وحيث ان الطرف الثاني يرغب في العمل لدى الطرف الأول ويقر بأنه مؤهل لأداء التزامات عمله المؤقت الموصوف في هذا العقد، وبناء عليه يوافق الطرف الأول على تعيين الطرف الثاني طبقا للقواعد المتعلقة بالعقود المؤقتة كما هي محددة طبقا لمواد قانون العمل رقم 14 لسنة 2025

双方同意以下条款与条件： ||| اتفق الطرفان على الشروط والأحكام التالي :

第一条：上述前言视为本合同不可分割的组成部分。 ||| مادة (01) يعتبر التمهيد السابق جزءاً لا يتجزأ من هذا العقد

职务与职责：第二条 ||| مادة (02) الوظيفة

1- 基于乙方的资质，甲方任命乙方担任 “ [{{الوظيفة}}] ” 职务，乙方承诺履行其岗位职责与义务。 ||| 1-إنه بناء على مؤهلات الطرف الثاني يقوم الطرف الأول بتعيين الطرف الثاني في وظيفة [{{الوظيفة}}] ، ويتعهد الطرف الثاني بأداء واجباته ومسئولياته.
2- 学历资质：乙方声明，根据本合同分配给他的工作与其学历、能力和经验相符。 ||| 2-المؤهلات الدراسية يقر الطرف الثاني بأن العمل المكلف به طبقا لهذا العقد يلائم مؤهلاته وقدراته وخبراته.
3- 实质性履职义务：根据 2025 年第 14 号《埃及劳动法》的规定，乙方的基本职责和核心义务如下： ||| 3-التزامات الأداء الجوهرية تكون واجبات الطرف الثاني الجوهرية ومسئولياته طبقا لقانون العمل رقم (14) لسنة 2025 وكما يلي:
4- 履行上述及前条中所列出的所有职责。 ||| 4-جميع الواجبات الواردة والمبينة في المادة السابقة.
5- 严格执行、遵守并服从甲方（公司）的所有内部规章制度和工作流程。 ||| 5-تطبيق ومتابعه وطاعة كافة اللوائح والنظم الخاصة بالعمل في الشركة الطرف الأول.
6- 严格保守甲方的信息、通信及各类文件内容的机密，包括其因职务便利获取或收到的任何内部资料。 ||| 6-المحافظة على سرية المعلومات والاتصالات ومحتويات المستندات الخاصة بالطرف الأول والتي يحصل عليها الطرف الثاني او يتلقاها بسبب وظيفته.
7- 妥善保管其经手或由其保管的甲方所有财产、文件和单据，并尽到普通人的注意与照顾义务。 ||| 7-الاهتمام والمحافظة على ممتلكات ومستندات وأوراق الطرف الأول الموجودة تحت يد الطرف الثاني ويبذل في ذلك اهتمام ورعاية الشخص العادي.
8- 对公司保持绝对忠诚。在甲方规定的工作时间内、非工作时间、年假或任何其他假期期间，未经甲方事先书面许可，乙方不得从事 any 外部兼职工作。 ||| 8-الإبقاء على الولاء اللازم للشركة وعدم الارتباط في وظيفة أو عمل خارجي وسواء كان ذلك بمقابل أو خارج ساعات عمل الطرف الثاني الاصلية المحددة بمعرفة الطرف الأول أو خلال الإجازة السنوية أو أي اجازه دون الحصول على موافقة كتابية من الطرف الأول لأداء هذا العمل.
员工承诺保守与雇主、客户或 any 关联公司的业务秘密，不得直接或间接地与雇主的客户、关联公司 or 竞争对手进行 any 沟通。 ||| ويتعهد الموظف بأن يحافظ على الأسرار الخاصة بأعمال صاحب العمل وعملائه أو أي من الشركات التابعة له وبأنه لن يقوم بالاتصال سواء مباشرة أو بطريق غير مباشر بأي من عملاء صاحب العمل الشركات التابعة له والشركات المنافسة.
9- 履行本合同其他条款、公司内部规章制度、2025 年第 14 号法第 134 条及相关部委补充决议所规定的其他一切职责与义务。 ||| 9-تنفيذ الواجبات والالتزامات المذكورة بعالية وكذلك تلك الواردة في المواد الأخرى من هذا العقد وغيرها من الالتزامات المنصوص عليها في قواعد ولوائح الشركة الداخلية وقانون العمل للماده 134 لقانون رقم 14لسنه 2025 والقرارات الوزارية المكملة له.
10- 员工若欲辞职，须提前一个月通知雇主。一旦在公司的聘用关系终止，员工须立即向雇主归还其保管的所有资金、文件、押金和/或属于公司的财产。 ||| 10-يتعهد الموظف بان يقوم بأخطار صاحب العمل برغبته بالاستقالة قبل تاريخ استقالته بشهر وأن يسلم إلى صاحب العمل بمجرد انتهاء عمله بالشركة ما بحوزته من أموال أو مستندات أو عهده أو ممتلكات تخص الشركة.
11- 当雇主的利益与员工个人利益或其三代以内亲属的利益发生 any 冲突时，员工有义务立即通知雇主。若有 any 可能影响其公正廉洁执行工作的原因，也须立即通知雇主。 ||| 11-يلتزم العامل بأن يخطر صاحب العمل فوراً كلما حدث تعارض بين مصالح صاحب العمل ومصالحه الشخصية ومصالح أحد اقرباءه حتى الدرجة الثالثة، كما يلتزم بأن يخطر صاحب العمل بأي سبب قد يؤثر على قيامه بمهام عمله بنزاهة.
12- 员工不得利用职务之便谋取个人私利、向客户借款，或因履行分配的工作而收受 any 资金 or 礼物。 ||| 12-لا يجوز للعامل استغلال وظيفته لتحقيق مصلحة شخصية أو الاقتراض من العملاء أو قبول اموال او هدايا مقابل قيامه بالعمل المسند إليه.
13- 双方同意，在合同期内产生的所有知识产权均归雇主独占所有，包括但不限于著作权、商业秘密，以及对发明、作品、计算机程序、软件、半导体芯片、技术及商业数据的修改和补充。 ||| 13-اتفق الطرفان على انه خلال فترة العقد تكون جميع حقوق الملكية الفكرية ملكية خاصة لصاحب العمل دون منازعة بما يتضمن ولا يقتصر على حقوق النشر واسرار المهنة وكذا التعديلات والاضافات على المبتكرات والاعمال وبرامج الحاسب الآلى وشرائح اشباه الموصلات.
these 知识产权是由员工在执行工作任务过程中，或通过使用雇主的材料及运营信息而独立开发或获得的。 ||| وكذا المعلومات والبيانات الفنية والتجارية المشار اليها هنا بالحقوق الفكرية (الممنوحة للعامل واو التي يقوم هو نفسه بتطويرها اثناء تنفيذ مهام وظيفته او عن طريق استخدام المواد او معلومات التشغيل الخاصة بصاحب العمل.
14- 员工在被解雇 or 辞职后整整一年内，针对原始知识产权所作出的 any 创新、发明、创作 or 成果，均视为雇主的财产。 ||| 14-تعتبر أية اختراعات أو إبداعات أو إنجازات تطرأ من قبل العامل على الحقوق الفكرية الأصلية في خلال عام كامل من الفصل أو الاستقالة ملكاً لصاحب العمل.
15- 员工承诺维护雇主 all 信息、通信 and 文件内容的机密性。员工绝不安装 or 使用 any 法律上未授权的计算机系统。 ||| 15-يتعهد الموظف بالمحافظة على سرية كافة المعلومات والاتصالات ومحتويات المستندات الخاصة بصاحب العمل والا يقوم بوضع أو تركيب او استعمال آية انظمة للحاسب الآلى غير مرخصة قانوناً.
16- 工作调配：公司有权派遣员工在埃及境内的不同项目现场执行任务（根据客户的需求），派遣期限由公司决定。若员工拒绝调配，将被视为根本性违约，公司有权终止本合同且无需支付任何补偿。 ||| 16-التكليف بعمل أخر يحق للشركة ارسال العامل للقيام بعمله في المواقع المختلفة التي قد تطلب من العملاء لمدة تحددها الشركة داخل جمهورية مصر العربية ويكون رفض العامل لذلك بمثابة مخالفة جوهرية تجيز للشركة انهاء هذا العقد دون تعويض.

合同期限：第三条 ||| مادة (03) مدة العقد

1- 本劳动合同期限为 一年，可续约。合同于 [{{تاريخ_البداية}}] 开始，至 [{{تاريخ_النهاية}}] 或 项目结束之日（以较早发生者为准）终止。 ||| 1-تكون مدة العقد سنة واحده قابلة للتجديد تبدأ من [{{تاريخ_البداية}}] وينتهي [{{تاريخ_النهاية}}] او بانتهاء فتره المشروع ايهما اقرب.
本合同可续签新合同 or 由雇主签署书面决定予以展期。员工在上述期间内能否继续留任，完全取决于其工作表现以及对分配任务的履行情况。 ||| ويجدد عقد عمل الموظف بعقد جديد أو بقرار مكتوب موقع من صاحب العمل، واستمرار عقد العمل خلال المدة المذكورة مرتبط ارتباطاً كلياً بحسن اداء الطرف الثاني والالتزام بالأعمال المكلف بها لدى الشركة.
2- 员工须接受为期 三（3）个月 的试用期。在此期间，甲方有权随时终止劳动合同，无需提前通知 or 警告。 ||| 2-يخضع العامل لفترة اختبار مدتها ثلاثة أشهر يحق للطرف الأول انهاء عقد العمل خلال تلك الفترة دون الحاجة إلى إنذار أو تنبيه.
3- 若雇主在试用期满后决定终止本合同，且原因不属于本合同第（8）条 or 2025 年第 14 号《劳动法》规定的违约终止情形，则雇主必须向员工支付全额薪资直至合同期满。 ||| 3-في حال قرر صاحب العمل إنهاء هذا العقد بعد فترة الاختبار لأي سبب غير المنصوص عليه في المادة رقم (8) من هذا العقد او علي غير المخالفات المنصوص عليها في حاله انهاء التعاقد طبقا لقانون العمل رقم 14 لسنه 2025 ، يدفع صاحب العمل للموظف أجره الكامل حتى نهاية هذا العقد.

税收与社保、薪资：第四条及第五条 ||| مادة (04) و (05) المقابل والضرائب

第四条：薪资 ||| مادة (04) المقابل المادي
甲方须向乙方支付每月 总薪资（Gross Salary）[{{الراتب_الشهري}}] 埃及镑。工资于 每月 1 号至 5 号之间 发放。 ||| يدفع الطرف الأول للطرف الثاني شهريا مرتب شامل قدره [{{الراتب_الشهري}}] ج فقط لا غير و يتم دفع الراتب في يوم الاول من كل شهر حتى اليوم الخامس
第五条：税收与社会保险 ||| مادة (05) الضرائب والتأمينات
甲方须从总薪资中扣除乙方应缴纳个人所得税、社保个人承担部分以及现行法律法规规定的其他应扣款项，并将这些款项直接上缴给有关政府部门。 ||| يستقطع الطرف الأول من المرتب الشامل للطرف الثاني شهريا المبالغ المستحقة عن ضريبة كسب العمل وحصة الموظف من التأمينات الاجتماعية وغيرها من الالتزامات والمستحقات المنصوص عليها في القوانين واللوائح السارية.
甲方承诺在整个工作期间为乙方提供医疗保险和社保。 ||| وستسدد تلك المبالغ مباشرة إلى الهيئات الحكومية المعنية. ويتعهد الطرف الاول بتوفير التأمين الصحي والاجتماعي للطرف الثاني طوال فتره العمل.

工作时间：第六条 ||| مادة (06) ساعات العمل

工作时间由甲方（公司）确定，且不得超过《劳动法》第 117 条及相关部委决议规定的最高上限。 ||| ساعات العمل هي تلك التي تحددها الشركة (الطرف الأول) على ألا تزيد عددياً عن الحد الأقصى المبين في قانون العمل للماده رقم 117 والقرارات الوزارية.
甲方可根据工作需要，在法律 and 部委决议允许的范围内调整工作时间。 ||| ويجوز للطرف الأول أن يعدل من مواعيد العمل طبقاً لمقتضيات العمل في حدود ساعات العمل المحددة في القانون والقرارات الوزارية الصادرة في هذا الخصوص.
在不违反关于规范工业企业劳工的 1961 年第 133 号法律规定的前提下，员工每天的实际工作时间不得超过 8 小时，每周不得超过 48 小时。 ||| مع عدم الإخلال بأحكام القانون رقم 133 لسنة 1961 في شأن تنظيم تشغيل العمال فى المنشآت الصناعية ، لا يجوز تشغيل العامل تشغيلاً فعلياً أكثر من ثماني ساعات فى اليوم ، أو ثمان وأربعين ساعة فى الأسبوع.
用餐和休息时间不计入实际工作时间。 ||| ولا تدخل فيها الفترات المخصصة لتناول الطعام والراحة.
雇主可不受实际工作时间相关条款 of 限制，在面临紧急、非正常 or 突发性工作需求时，要求员工加班。 ||| ويجوز لصاحب العمل عدم التقيد بالأحكام الواردة بالمواد القانونية الخاصة بساعات العمل الفعلية وتشغيل الافراد ساعات اضافية (من هذا القانون، إذا كان التشغيل بقصد مواجهة ضرورات عمل غير عادية، أو ظروف استثنائية.
在此类情况下，必须在加班发生后 7 天内向主管行政机关报告，并说明加班原因 and 编制工作所需的时间。 ||| ويشترط فى هذه الحالات إبلاغ الجهة الإدارية المختصة خلال سبعة أيام من وقوع ظروف العمل غير العادية أو الظروف الاستثنائية بمبررات التشغيل الإضافى والمدة اللازمة لإتمام العمل.
在此情况下，员工除了享有原工作时间的正常工资外，还有权获得加班费，加班费计算标准为：白天加班不低于原每小时工资的 35%；夜间加班不低于原每小时工资 of 70%。 ||| فى هذه الحالة يستحق العامل بالإضافة إلى أجره عن ساعات العمل الأصلية، أجره عن ساعات التشغيل الإضافية، بحيث لا يقل عن الأجر الذى يستحقه العامل مضافاً إليه (35٪) عن ساعة العمل النهارية (70٪) عن ساعة العمل الليلية تحسب على أساس أجر ساعة عمله الأصلية.
若加班恰逢休息日，员工有权获得等同于一天工资的额外补偿，且雇主须在下周内为其安排另一天补休。在any情况下，员工在单位的总停留时间每天不得超过 12 小时。 ||| فإذا وقع التشغيل فى يوم الراحة استحق العامل مثل أجره تعويضاً عن هذا اليوم، ويمنحه صاحب العمل يوماً آخر عوضاً عنه خلال الأسبوع التالي. وفى جميع الأحوال، لا يجوز أن تزيد ساعات وجود العامل بالمنشأة على اثنتى عشرة ساعة.
乙方承诺尊重并严格遵守工作时间，只要不超过《劳动法》规定的实际工作时间，无权向甲方索要 any 额外的薪资 or 奖金。 ||| يتعهد الطرف الثاني باحترام المواعيد وتنفيذها ولا يحق له مطالبة الطرف الأول بمرتب إضافي أو مكافأة من ساعات العمل تلك طالما انها لم تتجاوز ساعات العمل الفعلية المنصوص عليها في قانون العمل.
作为第一款规定的例外情况，在偏远地区 or 因工作性质 or 运营条件需要连续工作的岗位上，员工的周休假可以累积，但累积期间不得超过 8 周。 ||| واستثناء من الحكم الوارد فى الفقرة الأولى من هذه المادة، يجوز فى الأماكن البعيدة عن العمران، وفى الأعمال التى تتطلب طبيعة العمل، أو ظروف التشغيل فيها استمرار العمل تجميع الراحات الأسبوعية المستحقة للعامل عن مدة لا تجاوز ثمانية أسابيع.
内部工作组织与惩戒条例将规定获得 these 累积周休假的规则。 ||| وتحدد لائحة تنظيم العمل والجزاءات قواعد الحصول على الراحات الأسبوعية المجمعة.

年度休假：第七条 ||| مادة (07) الاجازات السنوية

员工享有带薪年假，年假不包括法定节假日、公共节日 and 周休假。 ||| يستحق العامل إجازة سنوية بأجر، لا يدخل فى حسابها أيام عطلات الأعياد والمناسبات الرسمية والراحة الأسبوعية.
具体规定如下：\n1. 服务第一年为 15 天。\n2. 从第二年起为 21 天。\n3. 在一家 or 多家雇主处累计服务满 10 整年，或年龄超过 50 岁 的员工，享有 30 天。\n4. 残疾人和侏儒症患者享有 45 天。 ||| وذلك على الوجه الآتي:\n1- خمسة عشر يوماً فى السنة الأولى.\n2- واحد وعشرون يوماً اعتباراً من السنة الثانية.\n3- ثلاثون يوماً لمن أمضى عشر سنوات كاملة لدى صاحب عمل أو أكثر، أو لمن تجاوزت سنه خمسين عاماً.\n4- خمسة وأربعون يوماً للأشخاص ذوى الإعاقة والأقزام.
若员工的服务期不足一年，其年假按实际工作时间比例计算，前提是员工在雇主处的服务期至少已满 6 个月。 ||| وإذا قلت مدة خدمة العامل عن سنة تكون إجازته بنسبة المدة التى قضاها في العمل بشرط أن يكون قد أمضى ستة أشهر على الأقل فى خدمة صاحب العمل.
在all情况下，对于在危险、有害健康的工作岗位 or 偏远地区（具体由主管部长根据相关部门意见作出的决议确定）工作的员工，其年假天数应增加 7 天。 ||| وفى جميع الأحوال، تزاد مدة الإجازة السنوية بمقدار سبعة أيام للعمال الذين يعملون فى الأعمال الخطرة، أو المضرة بالصحة، أو فى المناطق النائية، والتي يصدر بتحديدها قرار من الوزير المختص بعد أخذ رأى الجهات المعنية.
甲方和乙方承诺共同遵守 2025 年第 14 号《劳动法》的所有规定，特别是第五章关于休假权利的规定。 ||| ويلتزم الطرف الاول والثاني بالامتثال الى كافة مواد قانون العمل رقم 14 لسنه 2025 فيما يخص الاجازات (الباب الخامس).

解雇与终止：第八条 ||| مادة (08) الفصل من الوظيفة

A) 甲方有权根据 2025 年第 14 号法第（148）条规定的规则，在下列情况下启动对乙方的解雇程序并终止其与公司的合同： ||| أ (للطرف الأول الحق في البدء في إجراءات فصل الطرف الثاني وإنهاء تعاقده مع الشركة طبقا للقواعد المقررة بالمادة (148) من القانون رقم ( 14) لسنة 2025 وذلك في الحالات الآتية:
1- 证实员工冒用他人身份 or 提交伪造文件。 ||| 1-إذا ثبت انتحال العامل شخصية غير صحيحة أو قدم مستندات مزورة.
2- 证实员工犯下给雇主造成重大损失的错误，前提是雇主在获悉事件发生后 24 小时内向主管机关报告。 ||| ٢ -إذا ثبت ارتكاب العامل لخطأ نشأت عنه أضرار جسيمة لصاحب العمل ، بشرط أن يبلغ صاحب العمل الجهات المختصة بالواقعة ، أو الحادث خلال أربع وعشرين ساعة من وقت علمه بوقوعه.
3- 证实员工屡次不遵守员工安全 or 生产场所安全所需的规章制度，且 these 规章制度是以书面形式公布在显眼处的，同时员工之前已收到要求其遵守的书面警告。 ||| ٣ -إذا ثبت تكرار عدم مراعاة العامل التعليمات اللازم اتباعها لسلامة العمال ، أو المنشأة ، بشرط أن تكون هذه التعليمات مكتوبة ، ومعلنة فى مكان ظاهر ،رغم التنبيه عليه كتابة بمراعاة ذلك.
4- 证实员工泄露其所在企业的商业秘密，并对企业造成了严重损失。 ||| ٤ -إذا ثبت أن العامل أفشى أسرار المنشأة التى يعمل بها ، وأدى ذلك إلى إحداث أضرار جسيمة بالمنشأة.
5- 证实员工在同一业务领域内与雇主开展竞争。 ||| ٥ -إذا ثبت قيام العامل بمنافسة صاحب العمل فى ذات نشاطه.
6- 证实员工在工作时间内处于明显醉酒状态 or 受到其服用的麻醉物质的影响。 ||| ٦ -إذا ثبت وجود العامل فى حالة سكر بين أو متأثرا بما تعاطاه من مادة مخدرة أثناء ساعات العمل.
7- 证实员工在工作期间 or 因工作原因对雇主 or 总经理大打出手，或对 any 上级进行严重人身攻击。 ||| ٧ -إذا ثبت اعتداء العامل على صاحب العمل ، أو المدير العام ، وكذلك إذا وقع منه اعتداء جسيم على أحد رؤسائه أثناء العمل ، أو بسببه.

以下行为亦被视为严重违反劳动合同约定及根本性违约行为： ||| ويعتبر من الاخطاء الجسيمه التي بصددها يكون مخالفه للمتفق عليه داخل عقد العمل:
1- 乙方拒绝履行本合同第二条第三款中所指定的 any 一项核心义务。 ||| 1-إذا رفض الطرف الثاني تنفيذ واحدا أو أكثر من التزاماته الجوهرية في المادة رقم (02) الفقرة رقم (03) من هذا العقد
2- 乙方泄露与其从事的活动相关的私人 or 保密秘密。 ||| 2-إذا أفشى الطرف الثاني الأسرار الخاصة أو المتعلقة فيما باشره من نشاط
3- 乙方在用尽所有申诉渠道后，因涉及名誉、诚信 or 公共道德的罪行被依法判处终审判决。 ||| 3-إذا ما أدين الطرف الثاني بصفة نهائية في جريمة بعد استنفاذه كافة سبل الاستئناف تتعلق بالشرف أو الأمانة أو الآداب العامة
4- 乙方在一年内无甲方事先同意 or 甲方认可的正当理由，连续旷工 10 天 或间歇旷工 20 天。 ||| 4-إذا ما تغيب الطرف الثاني عن العمل خلال السنة (10) عشر أيام متصلة أو (20) عشرين يوما متتقطعين دون موافقة الطرف الأول المسبقة أو بسبب مقبول يقره الطرف الأول وفي هذه الحاله يعتبر العامل مستقيلا طبقا لقانون العمل
5- 乙方实施了甲方惩戒条例中明确规定予以解雇处罚的 any 行为。 ||| 5-إذا ارتكب الطرف الثاني فعلا منصوص عليه بلائحة جزاءات الطرف الأول تكون عقوبته الفصل من الشركة

一般条款：第九条至第十六条 ||| المواد من (09) إلى(16) المواد العامة

第九条：合同终止通知期\n任何一方在终止劳动合同前，必须至少提前 两个月 通知另一方。 ||| الماده رقم (9) مده اخطار انهاء العقد:\nيجب أن يتم اخطار كلا الطرفين الطرف الاخر قبل إنهاء عقد العمل بشهرين علي الاقل.
第十条：归还公司财产\n乙方同意，无论因 any 原因导致合同终止，均须立即将合同期内从甲方处接收并由其保管的 all 物品/设备/服装完好归还给甲方。若员工拒绝 or 违反此规定，甲方有权从其在公司的应得款项中扣除相关损失费用。 ||| مادة (10) إعادة ممتلكات الشركة\nيوافق الطرف الثاني إنه فور انتهاء التعاقد مع الطرف الأول لأي سبب كان بالقيام بتسليم الطرف الأول العهدة التي بحوزته والتي استلمها من الطرف الأول خلال مدة تعاقده بحالة جيدة شاملة المعدات والملابس والأجهزة أي ما كانت الحالة التي عليها أو أي ممتلكات أخرى يحصل عليها والتي تخص وترتبط بالطرف الأول، وفي حالة امتناعه أو مخالفته تنفيذ ذلك فمن حق الطرف الأول استقطاع التكاليف من مستحقاته لدى الشركة.
第十一条：适用法律\n本合同未尽 or 疏漏的事宜，一律适用埃及法律的规定，包括但不限于 2025 年第 14 号埃及《劳动法》、社会保险法及其执行条例和相关的部委决议。 ||| مادة (11) القانون المطبق\nتسري أحكام القوانين المصرية متضمنة دون تحديد أحكام قانون العمل المصري لسنه 2025 لرقم 14 وقانون التأمين الاجتماعي واللوائح التنفيذية والقرارات الوزارية المتعلقة بهما على أطراف هذا العقد فيما يتعلق بكافة المسائل التي لم يتضمنها أو غفل عنها في هذا العقد.
第十二条（合同误写为 21）：争议管辖\n因履行 or 解释本合同所引起的 any 争议，均由开罗各级各类法院排他性管辖。 ||| مادة (21) المنازعات\nتختص محاكم القاهرة على اختلاف درجاتها بحل أي نزاع ينجم عن تنفيذ هذا العقد أو تفسيره.
第十三条：通知与通讯\n本合同项下的 all 通知均须通过挂号信 or 派专人送达（附双执据）。若地址发生变动，乙方须在变动后一周内书面通知甲方。 ||| مادة (13) المخاطبات\nترسل المخاطبات المقررة طبقاً لهذا العقد بالبريد المسجل أو باليد مع علم الوصول ويقر الطرف الثاني بأن كافة المخاطبات التي ترسل على العنوان المبين بهذا العقد سوف تعتبر سارية بعد ثلاثة أيام من تاريخ إرسالها في نفس اليوم في حالة التسليم باليد. ويقر الطرف الثاني بإخطار الطرف الأول كتابياً بأي تغيير يطرأ على عنوانه في خلال أسبوع من حدوثه وإلا سيستمر العنوان المبين في هذا العقد هو الأساس والتخاطب عليه هو الصحيح.
第十四条：合同完整性与修改\n本合同（包括 all 附件）构成了双方达成的完整协议。本合同非经双方签署书面协议，不得擅自修改。 ||| مادة (14) مجمل العقد وتعديلاته\nيشكل هذا العقد متضمناً كافة مرفقاته العقد برمته المبرم بين الطرف الأول والطرف الثاني ولا يجوز تعديل هذا العقد إلا كتابياً ويوقع عليه الطرف الأول والطرف الثاني.
第十五条：内部规章制度\n乙方确认已阅读并知悉公司的内部规章制度以及规范工作流程的相关决定。 ||| مادة (15) اللوائح الداخليه\nيقر الطرف الثاني بأنه اطلع على اللائحة الداخلية للشركة والقرارات المنظمة لسير العمل.
第十六条（合同误写为 15）：合同文本\n本合同一式 四 份，内容完全相同。双方各执一份以兹遵守，第三份须提交至主管社会保险局备案。 ||| مادة (15) نسخ العقد:\nحرر هذا العقد من اربع نسخ طبق الاصل في التاريخ بعالية واستلم كل طرف نسخة للعمل بموجبها على أن يتم تسليم النسخة الثالثة الى مكتب التأمينات الاجتماعية المختص.
第十七条（合同中为 16）：语言文本\n本合同采用阿拉伯语和中文双语签署。如在理解 or 解释上出现 any 歧义 or 不一致，一律以 阿拉伯语 文本为准。 ||| مادة (16)\nتم تحرير هذا العقد باللغتين العربية والصينية ويكون النص باللغة العربية وفى حالة الاختلاف فى التفسير يعمل بالترجمة المحررة باللغة العربية.

签字页 ||| التوقيعات

甲方名称： 远大建筑与商业服务公司 ||| الطرف الأول : شركة يواندا للمقاولات و الخدمات التجاريه
签字： ||| التوقيع:
日期： ||| التاريخ:
乙方名称： ||| الطرف الثاني:
签字： ||| التوقيع:
日期： ||| التاريخ:`;
